staticMesh/2D/src/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }

    left
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    right
    {
        type            noSlip;
    }

    splittedChannelWalls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
