staticMesh/2D/src/constant/src/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

topoChanger
{
    type            refiner;


    libs            ("libfvMeshTopoChangers.so");

    mover           none;

    // How often to refine
    refineInterval  10;

    // Field to be refinement on
    field           alpha.liquid1;

    // Refine field in between lower..upper
    lowerRefineLevel 0.01;
    upperRefineLevel 0.99;

    // If value < unrefineLevel unrefine
    unrefineLevel   2.0;

    // Have slower than 2:1 refinement
    nBufferLayers   7;

    // Refine cells only up to maxRefinement levels
    maxRefinement   7;

    // Stop refinement if maxCells reached
    maxCells        1000000000;

    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    correctFluxes
    (
        (phi none)
        (nHatf none)
        (rhoPhi none)
        (alpha.liquid1 none)
        (ghf none)
    );

    // Write the refinement level as a volScalarField
    dumpLevel       true;
}


// ************************************************************************* //
