staticMesh/2D/src/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom       patch;
sourceCase          "$FOAM_CASE";

sourcePatches       (back);
exposedPatchName    front;

// extrudeModel        linearNormal;

extrudeModel        linearDirection;

nLayers             1;

expansionRatio      1.0;

// linearNormalCoeffs
// {
//     thickness       0.01;
// }

linearDirectionCoeffs
{
    direction       (0 0 -1);
    thickness       10.0;
}

flipNormals         false;
mergeFaces          false;
mergeTol            0;


// ************************************************************************* //
