staticMesh/2D/src/system/snappyHexMeshSrc/STLList
splittedChannel.stl
{
    type triSurfaceMesh;
    name splittedChannel;
}
splittedChannelWalls.stl
{
    type triSurfaceMesh;
    name splittedChannelWalls;
}
