staticMesh/2D/src/system/snappyHexMeshSrc/refinementSurfacesList
splittedChannelWalls
{
    level (1 1);
    patchInfo{type wall;}
}
